---@class equip_re
local equip_re = {}
local this = equip_re

------------------------------------------------------------------------------------
this.equip_pos = { { "弓", 1 }, { "项链", 2 }, { "手环", 3 }, { "指环", 4 }, { "上衣", 5 },
              { "下衣", 6 }, { "手套", 7 }, { "鞋靴", 8 } }
this.up_equip_list = {'迷离弓','龙角弓','秘行衣上衣','秘行衣下衣','秘行衣手套','秘行衣鞋靴','神灵项链','神灵指环'}
--     252632DB680   id:0x0BEEDEEA   make_id:0x00D903E0   make_pos_type:000013EC  name: 迷离弓
--this.stone_list = { '高级活力魔石', '稀有活力魔石' }
------------------------------------------------------------------------------------
this.make_equip_list4_ = {
    { '赤鬼灯',{'高级钢铁',40},{'高级邪念珠',4},{'高级月阴石',1},{'高级龙鳞',1},1000,1000,0xF5AAA1 },
    --{ '槲寄生木杖',{'高级钢铁',40},{'高级邪念珠',4},{'高级月阴石',1},{'高级龙鳞',1},1000,1000,0x00B8A1A1 },
    { '红花道衣上衣',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x0192D51F },
    --{ '丝绸魔衣上衣',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x0155CC1F },
    { '红花道衣下衣',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x0192D53D },
    --{ '丝绸魔衣下衣',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x0155CC3D },
    { '红花道衣手套',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x022B6BDB },
    --{ '丝绸魔衣手套',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x01EE62DB },
    { '红花道衣鞋靴',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x022B6BF9 },
    --{ '丝绸魔衣鞋靴',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x01EE62F9 },
    { '无我项链',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x02687481 },
    { '无我手环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x0268749F},
    { '无我指环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x03010B3D},
    { '无我耳环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙眼',1},1000,1000,0x03010EE9},
}
------------------------------------------------------------------------------------
this.make_equip_list4 = {
    --武器
    --{ '鬼面弓',{'高级钢铁',40},{'高级邪念珠',2},{'高级月阴石',2},{'高级龙鳞',1},1000,1000,0x00D72622 },
    { '迷离弓',{'稀有钢铁',75},{'稀有邪念珠',25},{'稀有月阴石',25},{'稀有龙鳞',1},50000,10000,0x00D903E0 },
    --{ '小龙弓',{'稀有钢铁',75},{'稀有邪念珠',25},{'稀有月阴石',25},{'稀有龙鳞',1},50000,10000,0xDBBA0B },
    { '角弓',{'高级钢铁',40},{'高级邪念珠',4},{'高级月阴石',1},{'高级龙鳞',1},1000,1000,0xD72621 },
    --上衣
    { '隐秘衣上衣',{'高级钢铁',20},{'高级武魂',1},{'高级伏魔神珠',2},{'高级龙皮',1},500,500,0x017450A0 },
    --{ '白蛇巫服上衣',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x017450A9 },
    --{ '鬼灵巫服上衣',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x017450A8 },
    --{ '丝绸衣上衣',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x0174509F },
    --下衣
    { '隐秘衣下衣',{'高级钢铁',20},{'高级武魂',1},{'高级伏魔神珠',2},{'高级龙皮',1},500,500,0x017450BE },
    --{ '白蛇巫服下衣',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x017450C7 },
    --{ '鬼灵巫服下衣',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x017450C6 },
    --{ '丝绸衣下衣',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x017450BD },
    --手套
    { '隐秘衣手套',{'高级钢铁',20},{'高级武魂',1},{'高级伏魔神珠',2},{'高级龙皮',1},500,500,0x020CE75C },
    --{ '白蛇巫服手套',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x020CE765 },
    --{ '鬼灵巫服手套',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x020CE764 },
    --{ '丝绸衣手套',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x20CE75B },
    --鞋靴
    { '隐秘衣鞋靴',{'高级钢铁',20},{'高级武魂',1},{'高级伏魔神珠',2},{'高级龙皮',1},500,500,0x020CE77A },
    --{ '白蛇巫服鞋靴',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x020CE783 },
    --{ '鬼灵巫服鞋靴',{'稀有钢铁',75},{'稀有武魂',25},{'稀有伏魔神珠',25},{'稀有龙皮',1},25000,5000,0x020CE782 },
    --{ '丝绸衣鞋靴',{'高级钢铁',20},{'高级武魂',2},{'高级伏魔神珠',1},{'高级龙皮',1},500,500,0x20CE779 },
    --项链
    { '无我项链',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x02687481 },
    --{ '猛攻项链',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙角',1},50000,10000,0x0268748A },
    { '不动项链',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙角',1},50000,10000,0x0268748B },
    --{ '鬼门项链',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x2687482 },
    --手镯
    { '无我手环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x0268749F},
    { '猛攻手环',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙角',1},50000,10000,0x026874A8 },
    --{ '不动手环',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙角',1},50000,10000,0x026874A9 },
    --{ '鬼门手环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x26874A0 },
    --指环
    { '无我指环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x03010B3D},
    { '猛攻指环',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙角',1},50000,10000,0x03010B46 },
    --{ '不动指环',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙角',1},50000,10000,0x03010B47 },
    --{ '鬼门指环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙角',1},1000,1000,0x4CACEBE },
    --耳环
    { '无我耳环',{'高级白金',40},{'高级矿片',4},{'高级灵石',1},{'高级龙眼',1},1000,1000,0x03010EE9},
    { '猛攻耳环',{'稀有白金',75},{'稀有矿片',25},{'稀有灵石',25},{'稀有龙眼',1},50000,50000,0x03010EF1 },
    --辅助武器
    --{ '皮革箭筒',{'高级钢铁',40},{'高级邪念珠',2},{'高级月阴石',2},{'高级龙爪',1},1000,1000,0x00D72A0A },
    --{ '迷离箭筒',{'稀有钢铁',75},{'稀有邪念珠',25},{'稀有月阴石',25},{'稀有龙爪',1},50000,10000,0x00DBBDF1 },
}

------------------------------------------------------------------------------------
this.make_equip_list2_ = {
    { '赤灭鬼灯',{'赤炎鬼灯',2},15000,4000,0x00FA3E87 },
    { '赤炎鬼灯',{'赤火鬼灯',2},10000,3000,0x00FA3E85 },
    { '赤火鬼灯',{'赤鬼灯',2},5000,2000,0x00FA3E83 },
    --{ '魔焰杖',{'烈焰杖',2},15000,4000,0x00BD3587 },
    --{ '烈焰杖',{'灵魔杖',2},10000,3000,0x00BD3585 },
    --{ '灵魔杖',{'槲寄生木杖',2},5000,2000,0x00BD3583 },
    { '火灵道衣上衣',{'艳红道衣上衣',2},7500,2000,0x0192D525 },
    { '艳红道衣上衣',{'赤火道衣上衣',2},5000,1500,0x0192D523 },
    { '赤火道衣上衣',{'红花道衣上衣',2},2500,1000,0x0192D521 },
    { '火灵道衣下衣',{'艳红道衣下衣',2},7500,2000,0x0192D543 },
    { '艳红道衣下衣',{'赤火道衣下衣',2},5000,1500,0x0192D541 },
    { '赤火道衣下衣',{'红花道衣下衣',2},2500,1000,0x0192D53F },
    { '火灵道衣手套',{'艳红道衣手套',2},7500,2000,0x022B6BE1 },
    { '艳红道衣手套',{'赤火道衣手套',2},5000,1500,0x022B6BDF },
    { '赤火道衣手套',{'红花道衣手套',2},2500,1000,0x022B6BDD },
    { '火灵道衣鞋靴',{'艳红道衣鞋靴',2},7500,2000,0x022B6BFF },
    { '艳红道衣鞋靴',{'赤火道衣鞋靴',2},5000,1500,0x022B6BFD },
    { '赤火道衣鞋靴',{'红花道衣鞋靴',2},2500,1000,0x022B6BFB },
    --{ '赤焰魔衣上衣',{'狂焰魔衣上衣',2},7500,2000,0x0155CC25 },
    --{ '狂焰魔衣上衣',{'火焰魔衣上衣',2},5000,1500,0x0155CC23 },
    --{ '火焰魔衣上衣',{'丝绸魔衣上衣',2},2500,1000,0x0155CC21 },
    --{ '赤焰魔衣下衣',{'狂焰魔衣下衣',2},7500,2000,0x0155CC43 },
    --{ '狂焰魔衣下衣',{'火焰魔衣下衣',2},5000,1500,0x0155CC41 },
    --{ '火焰魔衣下衣',{'丝绸魔衣下衣',2},2500,1000,0x0155CC3F },
    --{ '赤焰魔衣手套',{'狂焰魔衣手套',2},7500,2000,0x01EE62E1 },
    --{ '狂焰魔衣手套',{'火焰魔衣手套',2},5000,1500,0x01EE62DF },
    --{ '火焰魔衣手套',{'丝绸魔衣手套',2},2500,1000,0x01EE62DD },
    --{ '赤焰魔衣鞋靴',{'狂焰魔衣鞋靴',2},7500,2000,0x01EE62FF },
    --{ '狂焰魔衣鞋靴',{'火焰魔衣鞋靴',2},5000,1500,0x01EE62FD },
    --{ '火焰魔衣鞋靴',{'丝绸魔衣鞋靴',2},2500,1000,0x01EE62FB },
    { '神灵项链',{'罗汉项链',2},15000,4000,0x02687487 },
    { '罗汉项链',{'无心项链',2},10000,3000,0x02687485 },
    { '无心项链',{'无我项链',2},5000,2000,0x02687483 },
    { '神灵手环',{'罗汉手环',2},15000,4000,0x026874A5 },
    { '罗汉手环',{'无心手环',2},10000,3000,0x026874A3 },
    { '无心手环',{'无我手环',2},5000,2000,0x026874A1 },
    { '神灵指环',{'罗汉指环',2},15000,4000,0x03010B43 },
    { '罗汉指环',{'无心指环',2},10000,3000,0x03010B41 },
    { '无心指环',{'无我指环',2},5000,2000,0x03010B3F },
    { '神灵耳环',{'罗汉耳环',2},15000,15000,0x03010EEF },
    { '罗汉耳环',{'无心耳环',2},10000,10000,0x03010EED },
    { '无心耳环',{'无我耳环',2},5000,5000,0x03010EEB },
}
------------------------------------------------------------------------------------
this.make_equip_list2 = {
    --武器
    --{ '地狱魔弓',{'魔罗弓',2},15000,4000,0x00DBBA08 },
    --{ '魔罗弓',{'鬼魔弓',2},10000,3000,0x00DBBA06},
    --{ '鬼魔弓',{'鬼面弓',2},5000,2000,0x00DBBA04 },
    { '八极迷离弓',{'迷离弓',2},100000,15000,0x00DBBA0C },
    { '龙角弓',{'铁角弓',2},15000,4000,0xDBBA07 }, --4阶攻击套
    { '铁角弓',{'牛角弓',2},10000,3000,0xDBBA05 }, --3阶攻击套
    { '牛角弓',{'角弓',2},5000,2000,0xDBBA03 }, --2阶攻击套
    { '月光弩',{'赤月弩',2},200000,25000,0x00DBBA10 }, --4阶稀有攻击套
    { '赤月弩',{'八极迷离弓',2},150000,20000,0x00DBBA0E }, --3阶稀有攻击套
    --上衣
    { '秘行衣上衣',{'暗行衣上衣',2},7500,2000,0x017450A6 },
    { '暗行衣上衣',{'潜行衣上衣',2},5000,1500,0x017450A4 },
    { '潜行衣上衣',{'隐秘衣上衣',2},2500,1000,0x017450A2 },
    --{ '武极巫服上衣',{'白蛇巫服上衣',2},50000,7500,0x017450AB },
    --{ '镇魂巫服上衣',{'白莲巫服上衣',2},100000,12500,0x17450AE }, --4阶稀有攻击套
    --{ '白莲巫服上衣',{'鬼魂巫服上衣',2},75000,10000,0x17450AC }, --3阶稀有攻击套
    --{ '鬼魂巫服上衣',{'鬼灵巫服上衣',2},50000,7500,0x017450AA }, --2阶稀有攻击套
    --{ '密影衣上衣',{'阴影衣上衣',2},7500,2000,0x17450A5 }, --4阶攻击套
    --{ '阴影衣上衣',{'残影衣上衣',2},5000,1500,0x17450A3 }, --3阶攻击套
    --{ '残影衣上衣',{'丝绸衣上衣',2},2500,1000,0x17450A1 }, --2阶攻击套
    --下衣
    { '秘行衣下衣',{'暗行衣下衣',2},7500,2000,0x017450C4 },
    { '暗行衣下衣',{'潜行衣下衣',2},5000,1500,0x017450C2 },
    { '潜行衣下衣',{'隐秘衣下衣',2},2500,1000,0x017450C0 },
    --{ '武极巫服下衣',{'白蛇巫服下衣',2},50000,7500,0x017450C9 },
    --{ '镇魂巫服下衣',{'白莲巫服下衣',2},100000,12500,0x017450CC }, --4阶稀有攻击套
    --{ '白莲巫服下衣',{'鬼魂巫服下衣',2},75000,10000,0x017450CA }, --3阶稀有攻击套
    --{ '鬼魂巫服下衣',{'鬼灵巫服下衣',2},50000,7500,0x017450C8 }, --2阶稀有攻击套
    --{ '密影衣下衣',{'阴影衣下衣',2},7500,2000,0x17450C3 }, --4阶攻击套
    --{ '阴影衣下衣',{'残影衣下衣',2},5000,1500,0x17450C1 }, --3阶攻击套
    --{ '残影衣下衣',{'丝绸衣下衣',2},2500,1000,0x17450BF }, --2阶攻击套
    --手套
    { '秘行衣手套',{'暗行衣手套',2},7500,2000,0x020CE762 },
    { '暗行衣手套',{'潜行衣手套',2},5000,1500,0x020CE760 },
    { '潜行衣手套',{'隐秘衣手套',2},2500,1000,0x020CE75E },
    --{ '武极巫服手套',{'白蛇巫服手套',2},50000,7500,0x020CE767 },
    --{ '镇魂巫服手套',{'白莲巫服手套',2},100000,12500,0x020CE76A }, --4阶稀有攻击套
    --{ '白莲巫服手套',{'鬼魂巫服手套',2},75000,10000,0x020CE768 }, --3阶稀有攻击套
    --{ '鬼魂巫服手套',{'鬼灵巫服手套',2},50000,7500,0x020CE766 }, --2阶稀有攻击套
    --{ '密影衣手套',{'阴影衣手套',2},7500,2000,0x20CE761 }, --4阶攻击套
    --{ '阴影衣手套',{'残影衣手套',2},5000,1500,0x20CE75F }, --3阶攻击套
    --{ '残影衣手套',{'丝绸衣手套',2},2500,1000,0x20CE75D }, --2阶攻击套
    --鞋靴
    { '秘行衣鞋靴',{'暗行衣鞋靴',2},7500,2000,0x020CE780 },
    { '暗行衣鞋靴',{'潜行衣鞋靴',2},5000,1500,0x020CE77E },
    { '潜行衣鞋靴',{'隐秘衣鞋靴',2},2500,1000,0x020CE77C },
    --{ '武极巫服鞋靴',{'白蛇巫服鞋靴',2},50000,7500,0x020CE785 },
    --{ '镇魂巫服鞋靴',{'白莲巫服鞋靴',2},100000,12500,0x020CE788 }, --4阶稀有攻击套
    --{ '白莲巫服鞋靴',{'鬼魂巫服鞋靴',2},75000,10000,0x020CE786 }, --3阶稀有攻击套
    --{ '鬼魂巫服鞋靴',{'鬼灵巫服鞋靴',2},50000,7500,0x020CE784 }, --2阶稀有攻击套
    --{ '密影衣鞋靴',{'阴影衣鞋靴',2},7500,2000,0x20CE77F }, --4阶攻击套
    --{ '阴影衣鞋靴',{'残影衣鞋靴',2},5000,1500,0x20CE77D }, --3阶攻击套
    --{ '残影衣鞋靴',{'丝绸衣鞋靴',2},2500,1000,0x20CE77B }, --2阶攻击套
    --项链
    { '神灵项链',{'罗汉项链',2},15000,4000,0x02687487 },
    { '罗汉项链',{'无心项链',2},10000,3000,0x02687485 },
    { '无心项链',{'无我项链',2},5000,2000,0x02687483 },
    { '护身项链',{'猛攻项链',2},100000,15000,0x0268748C },
    { '月光项链',{'金刚项链',2},200000,25000,0x02687490 }, --4阶攻击套
    { '金刚项链',{'护身项链',2},150000,20000,0x0268748E }, --3阶攻击套
    --{ '星辉项链',{'降魔项链',2},15000,4000,0x02687488 }, --4阶防御套
    --{ '降魔项链',{'破邪项链',2},10000,3000,0x02687486 }, --3阶防御套
    --{ '破邪项链',{'鬼门项链',2},5000,2000,0x02687484 }, --2阶防御套
    --手镯
    { '神灵手环',{'罗汉手环',2},15000,4000,0x026874A5 },
    { '罗汉手环',{'无心手环',2},10000,3000,0x026874A3 },
    { '无心手环',{'无我手环',2},5000,2000,0x026874A1 },
    { '护身手环',{'猛攻手环',2},100000,15000,0x026874AA },
    { '月光手环',{'金刚手环',2},200000,25000,0x026874AE }, --4阶攻击套
    { '金刚手环',{'护身手环',2},150000,20000,0x026874AC }, --3阶攻击套
    --{ '星辉手环',{'降魔手环',2},15000,4000,0x026874A6 }, --4阶防御套
    --{ '降魔手环',{'破邪手环',2},10000,3000,0x026874A4 }, --3阶防御套
    --{ '破邪手环',{'鬼门手环',2},5000,2000,0x026874A2 }, --2阶防御套
    --指环
    { '神灵指环',{'罗汉指环',2},15000,4000,0x03010B43 },
    { '罗汉指环',{'无心指环',2},10000,3000,0x03010B41 },
    { '无心指环',{'无我指环',2},5000,2000,0x03010B3F },
    { '护身指环',{'猛攻指环',2},100000,15000,0x03010B48 },
    { '月光指环',{'金刚指环',2},200000,25000,0x03010B4C }, --4阶攻击套
    { '金刚指环',{'护身指环',2},150000,20000,0x03010B4A }, --3阶攻击套
    --{ '星辉指环',{'降魔指环',2},15000,4000,0x03010B44 }, --4阶防御套
    --{ '降魔指环',{'破邪指环',2},10000,3000,0x03010B42 }, --3阶防御套
    --{ '破邪指环',{'鬼门指环',2},5000,2000,0x03010B40 }, --2阶防御套
    --耳环
    { '神灵耳环',{'罗汉耳环',2},15000,15000,0x03010EEF },
    { '罗汉耳环',{'无心耳环',2},10000,10000,0x03010EED },
    { '无心耳环',{'无我耳环',2},5000,5000,0x03010EEB },
    { '护身耳环',{'猛攻耳环',2},100000,15000,0x03010EF3 },
    --辅助武器
    --{ '白虎箭筒',{'虎皮箭筒',2},15000,15000,0x00DBBDF0 },
    --{ '虎皮箭筒',{'饿狼箭筒',2},10000,10000,0x00DBBDEE },
    --{ '饿狼箭筒',{'皮革箭筒',2},5000,5000,0x00DBBDEC },
    --{ '八极箭筒',{'迷离箭筒',2},100000,100000,0x00DBBDF3 },
}

------------------------------------------------------------------------------------
function equip_re.__tostring()
    return "mir4 pet package"
end

equip_re.__index = equip_re

function equip_re:new(args)
    local new = {}
    if args then
        for key, val in pairs(args) do
            new[key] = val
        end
    end
    return setmetatable(new, equip_re)
end

return equip_re:new()