---@class item_re
local item_re = {}
local this = item_re
------------------------------------------------------------------------------------
this.sell_list = { '破邪项链','鬼门指环','无尽的赤月魔剑','褪色的玄武珠','褪色的白虎珠','触龙神皮','百年貂鼠的元气','生灵的符咒','蛇妖族长的逆鳞','活力结晶残片','魔力结晶残片','半兽人角笛','猪雕像','大型生命值恢复药水','大型魔力恢复药水','鬼门项链','鬼门手环','鬼面弓','鬼魔弓','残影衣手套','残影衣上衣','残影衣下衣','残影衣鞋靴','丝绸衣鞋靴','丝绸衣上衣','丝绸衣下衣','丝绸衣手套','小型生命值恢复药水','小型魔力恢复药水','矿石碎片','老木弓','老粗布衣上衣','老粗布衣下衣','老粗布衣鞋靴','老粗布衣手套',
                  '角碎片','茎干碎片','蘑菇碎片','高级月戟残片','高级日戟残片','高级武戟残片','高级星戟残片','高级天魂结晶','高级飞魂结晶','高级武魂结晶','高级血魂结晶','高级专注魔石','高级魔力魔石','高级武力魔石','高级摧毁魔石','高级觉醒魔石','回城卷轴' }
this.sell_list_ex = { '隐秘衣上衣','隐秘衣手套','角弓','牛角弓','破邪项链','鬼门指环','鬼门项链','鬼门手环','鬼面弓','鬼魔弓','残影衣手套','残影衣上衣','残影衣下衣',
                      '残影衣鞋靴','丝绸衣鞋靴','丝绸衣上衣','丝绸衣下衣','丝绸衣手套','老粗布衣上衣','老粗布衣下衣','老粗布衣鞋靴','老粗布衣手套','老木弓',
                      '无我手环','无我指环','无我项链','破邪指环','破邪手环','稀有专注魔石','稀有魔力魔石', '稀有武力魔石','稀有摧毁魔石','稀有觉醒魔石',
                      '齐天大圣如意孙','乌龙先生牛牛','青海鬼王丹丹','河马法师波优波优','武神猫头云长','烛火小灯笼','变脸师叉叉','黑邪尊毛思罗','犬大人旺旺萌','短铁甲忠将翼德','天尊喵特昂',
                      '稀有比奇魔物结晶','高级比奇魔物结晶','高级比奇首领的邪念','稀有比奇首领的邪念','高级比奇首领魂石','稀有比奇首领魂石','高级比奇魔物元气','稀有比奇魔物元气',
                      '百年貂鼠的元气','活力结晶残片','魔力结晶残片','半兽人角笛','小型生命值恢复药水','小型魔力恢复药水','矿石碎片', '角碎片','茎干碎片',
                      '蘑菇碎片', '高级月戟残片','高级日戟残片','高级武戟残片','高级星戟残片','高级天魂结晶','高级飞魂结晶','高级武魂结晶','高级血魂结晶',
                      '高级专注魔石','高级降魔魔石','高级魔力魔石', '高级武力魔石','高级摧毁魔石','高级觉醒魔石','回城卷轴','古老的千年果果实', '嗜魂镐头', '褪色的竹笛',
                      '冤魂的结晶残片', '无尽的天星甲', '魔教修炼书', '摧毁结晶残片', '褪色的白虎珠', '猪雕像', '魔力结晶残片', '蛇妖族长的逆鳞', '褪色的玄武珠',
                      '无尽的赤月魔剑', '触龙神皮', '无尽的太极牌', '生灵的符咒','豚豚的磨刀石','穷豚的磨刀石', '元圣的太极牌', '紫青铃', '摧毁结晶石', '雷铃', '风镐', '活力结晶石',
                      '百年貂鼠的如意珠', '竹笛', '玄武珠', '冤魂的结晶石', '魔教秘籍', '无圣的赤月魔剑', '冤灵符咒', '褪色的雷铃', '千年果果实', '威龙神皮', '花猪雕像', '蛇妖女王的逆鳞',
                      '魔力结晶石', '白虎珠', '半兽人突击队长的角笛', '苍穹之愿' }
this.box_list = { '高级精灵宝物支援箱', '稀有精灵宝物支援箱', '10级达成奖励宝盒', '20级达成奖励宝盒', '30级达成奖励宝盒', '40级达成奖励宝盒', '45级达成奖励宝盒', '稀有材料箱', '稀有进击圣药', '高级进击圣药', '英雄进击圣药', '稀有富饶丹药', '稀有贪婪丹药', '稀有进击丹药', '稀有贪婪圣药', '高级活力魔石箱' }
this.stone_list = { '高级活力魔石','高级魔力魔石','高级专注魔石','高级武力魔石','高级觉醒魔石','' }
this.item_id_list = {
    ['花酒'] = { id = 0x1312ECD, shop_id = 0x838 },
    ['中型生命值恢复药水'] = { id = 0x1312E9D, shop_id = 0x1388 },
    ['中型魔力恢复药水'] = { id = 0x1312EA0, shop_id = 0x1388 },
    ['瞬移卷轴'] = { id = 0x1312EB1, shop_id = 0x13A6 },
    ['【秋药东】的杂物箱'] = { id = 0x1312ED0, shop_id = 0x83C },
}
this.auction_list = {
    { name = '高级药草叶', id = 0x35B5B247 },
    { name = '药草叶', id = 0x35B5B246 },
    { name = '高级灵芝', id = 0x35B5B2AB },
    { name = '灵芝', id = 0x35B5B2AA },
    { name = '高级药草根', id = 0x35B5B30F },
    { name = '药草根', id = 0x35B5B30E },
    { name = '高级钢铁', id = 0x35C4F4EA },


}

this.ticket_item = { '传说精灵石召唤券', '神龙材料召唤券', '龙爪召唤券', '宝牌召唤券', '龙眼召唤券', '龙珠召唤券', '龙鳞召唤券', '武功秘籍召唤券' }
------------------------------------------------------------------------------------

function item_re.__tostring()
    return "mir4 pet package"
end

item_re.__index = item_re

function item_re:new(args)
    local new = {}
    if args then
        for key, val in pairs(args) do
            new[key] = val
        end
    end
    return setmetatable(new, item_re)
end

return item_re:new()